package com.konstantinova.algorithms.luckytickets;

/**
 * ЗАДАНИЕ
 * УРОВЕНЬ JUNIOR
 * 6-значный билет считается счастливым,
 * если сумма 3 первых цифр равна сумме последних 3 цифр.
 * Посчитать, сколько существует счастливых 6-значных билетов.

 * УРОВЕНЬ MIDDLE
 * Прочитать условие задачи \1.Tickets\problem.txt
 * Решить задачу в общем случае и протестировать вручную на тестах, которые находятся в ресурсах.

 * УРОВЕНЬ SENIOR
 * Создать систему тестирования на основе файлов.
 * Проверить работу программы в автоматическом режиме.
 */
public class LuckyTickets {
}
